In [55]:
"""
이전내용 복습 문제풀이
"""

'\n이전내용 복습 문제풀이\n'

In [59]:
pip install numpy
import numpy as np

SyntaxError: invalid syntax (2403565453.py, line 1)

In [60]:
'''
1. 하나의 리스트를 만들고, 해당 리스트의 값의 결과가 첫번째 :10, 두번째 :20, 세번째 : 30, 네번째 : [1,2,3]
값이 들어가도록 만드시오.
'''
data = [10,20,30,[1,2,3]]
print(data)

[10, 20, 30, [1, 2, 3]]

In [61]:
'''
2. 해당 리스트를 인덱싱해 [1,2,3]의 값이 도출되게 하시오
'''
data[3]

[1, 2, 3]

In [62]:
'''
3. 수학점수 : 20, 30, 40, 50, 60, 영어점수 : 50, 70, 50, 60, 90 으로 
두개의 리스트로 생성하시오.
'''
math = [20,30,40,50,60]
english = [50,70,50,60,90]

In [63]:
'''
4.  https://www.youtube.com/ 를 www.naver.com으로 변경하시오.
'''
str = "https://www.youtube.com/"
str[6:].replace("/","").replace("youtube","naver")

'www.naver.com'

In [64]:
'''
5. 해당 리스트의 값을 계산해 수학점수와 영어점수 각각의 값의 평균을 계산하시오.
'''
# 1) 배열 미변환 
ma_m = sum(math)/len(math)
eg_m = sum(english)/len(english)
print("수학 :" , ma_m , " 영어 :" ,eg_m)
# 2) 배열 변환

수학 : 40.0  영어 : 64.0

In [65]:
'''
6.1,2,100,4,5, 900 해당 값을 가지는 배열을 생성하시고, 100과 900을 제거하시오.
'''
arr = np.array([1,2,100,4,5,900])
arr = np.delete(arr ,[2,5])
print(arr)

[1 2 4 5]

In [66]:
'''
7. 문제 3번의 값을 딕셔너리 형태로 저장하시오.
'''
dic = {"수학" : ma, "영어" : eg}

In [67]:
'''
8. 3번의 리스트를 딕셔너리 형태로 저장하고
수학점수 첫번째 값과, 영어점수 세번째 값의 합을 계산하시오.
'''
print(dic["수학"][0] + dic["영어"][2])

70

In [69]:
"""
4월 7일 강의 내용
데이터 프레임(Data frame)
"""

SyntaxError: invalid syntax (3480573388.py, line 5)

In [71]:
pip install pandas

Requirement already satisfied: pandas in c:\users\pc502\anaconda3\envs\kangjugwang\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\pc502\anaconda3\envs\kangjugwang\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\pc502\anaconda3\envs\kangjugwang\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.1 in c:\users\pc502\anaconda3\envs\kangjugwang\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: numpy>=1.20.3 in c:\users\pc502\anaconda3\envs\kangjugwang\lib\site-packages (from pandas) (1.24.4)
Requirement already satisfied: six>=1.5 in c:\users\pc502\anaconda3\envs\kangjugwang\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [72]:
import pandas as pd

In [77]:
data = np.array([
    [1,'Alice', 30],
    [2, 'Bob',25],
    [3, 'Charlle',35]
])
df = pd.DataFrame(data)
print(df)

   0        1   2
0  1    Alice  30
1  2      Bob  25
2  3  Charlle  35

In [80]:
df = pd.DataFrame(data, columns = ['ID','Name','Age'])
print(df)

  ID     Name Age
0  1    Alice  30
1  2      Bob  25
2  3  Charlle  35

In [86]:
data = {
    'name': ['Alice', 'Bob', 'Charlie'],
    'Age' : [25, 30, 35], 
    'City': ['New York', 'Paris', 'London'] }
df = pd.DataFrame(data)
print(df)

      name  Age      City
0    Alice   25  New York
1      Bob   30     Paris
2  Charlie   35    London

In [116]:
dp = pd.read_csv('C:/Users/PC502/Desktop/새 폴더/4_7.csv', header =0, encoding = 'cp949')
print("헤더 있음 \n",dp)
dp = pd.read_csv('C:/Users/PC502/Desktop/새 폴더/4_7.csv', header =None, encoding = 'cp949')
print("\n헤더 없음 \n",dp)
dp

헤더 있음
       Name   Age      City
0    Alice    25  New York
1      Bob    30     Paris
2  Charlie    25    London

헤더 없음
          0     1         2
0     Name   Age      City
1    Alice    25  New York
2      Bob    30     Paris
3  Charlie    25    London

         0     1         2
0     Name   Age      City
1    Alice    25  New York
2      Bob    30     Paris
3  Charlie    25    London

In [125]:
print(df.shape)
print(df.columns)
print(df.dtypes)
print(df.describe())
print(df.head())
print(df.tail())

(3, 3)
Index(['name', 'Age', 'City'], dtype='object')
name    object
Age      int64
City    object
dtype: object
        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0
      name  Age      City
0    Alice   25  New York
1      Bob   30     Paris
2  Charlie   35    London
      name  Age      City
0    Alice   25  New York
1      Bob   30     Paris
2  Charlie   35    London